[
    {
        "id": "/subscriptions/03149062-a982-4abf-b406-7e0d9ca2f1ca/resourceGroups/sentinelsoc/providers/Microsoft.OperationalInsights/workspaces/testenvr1/providers/Microsoft.SecurityInsights/alertRules/32495d2d-27d7-4bb7-8417-c757a5794626",
        "name": "32495d2d-27d7-4bb7-8417-c757a5794626",
        "etag": "\"7706a046-0000-0100-0000-68b5954a0000\"",
        "type": "Microsoft.SecurityInsights/alertRules",
        "kind": "Scheduled",
        "properties": {
            "queryFrequency": "PT6H",
            "queryPeriod": "P1D",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "SingleAlert"
            },
            "incidentConfiguration": {
                "createIncident": true,
                "groupingConfiguration": {
                    "enabled": false,
                    "reopenClosedIncident": false,
                    "lookbackDuration": "PT5H",
                    "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": []
                }
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "Name",
                            "columnName": "UserPrincipalName"
                        }
                    ]
                },
                {
                    "entityType": "IP",
                    "fieldMappings": [
                        {
                            "identifier": "Address",
                            "columnName": "IPAddress"
                        }
                    ]
                }
            ],
            "severity": "Low",
            "query": "SigninLogs\r\n| where ResultType in (\"50126\",\"50020\",\"16003\",\"50055\",\"50105\")",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
            "tactics": [],
            "techniques": [],
            "displayName": "Test-Suspicious signins",
            "enabled": true,
            "description": "Testing the suspicious Sign in logs.",
            "alertRuleTemplateName": null,
            "lastModifiedUtc": "2025-09-01T12:44:57.7765934Z"
        }
    }
]